Repository: a-gubskiy/X.DynamicData
Catalog: Site/App_GlobalResources/Global.*.resx
Languages: ru

source: Add
ru: Добавить

# AreYourSureToRemoveRecord
source: return confirm('Are your sure to remove record?');
ru: return confirm('Вы уверенны, что хотите удалить запись?');

# AreYourSureToRemoveRecords
source: return confirm('Are your sure to remove records?');
ru: return confirm('Вы уверенны, что хотите удалить записи?');

source: Cancel
ru: Отменить

# CantInitDataModelAssembly
source: System can not init assembly with data model.
ru: Невозможно инициализировать сборку c моделью данных! Проверьте конфигурацию системы.

source: Database
ru: База данных

source: Database name
ru: Название базы данных

source: Database server
ru: Сервер базы данных

source: Debug mode
ru: Режим отладки

# EditPageTitle
source: Edit
ru: Редактирование

source: File
ru: Файл

source: File storage connection string
ru: Строка подключения к файловому хранилишу

source: File storage url
ru: Url файлового хранилища

source: File upload
ru: Загрузка файлов

# FileUploadDescription
source: You can upload files to server
ru: Здесь вы можете загрузить на сервер необходимые файлы.

# FileUploadPageTitle
source: Upload
ru: Загрузка файлов

# HomePageTitle
source: Home
ru: Главная

# InsertPageTitle
source: Create record at
ru: Добавление записи в

source: Login
ru: Ваш логин

# LoginPageTitle
source: Authorization
ru: Авторизация

source: Logout
ru: Выход из системы

# LogPageTitle
source: Logs
ru: Системные логи

# ManagePageDescription
source: Manage web-application
ru: Управлять состоянием веб-приложения.

# ManagePageTitle
source: Manage
ru: Управление

# ModelIsEmpty
source: Model has no tables
ru: Модель данных не содержит таблиц. Проверьте конфигурацию системы.

source: No such item
ru: Записи отсутствуют

source: Password
ru: Пароль

source: Project
ru: Проект

# RecordPerPage
source: Records per page
ru: Записей на странице:

source: Remove selected
ru: Удалить выбранные записи

source: Restart web-application
ru: Перезапуск сайта

source: RestartWebApplicationDescription
ru: перезапуск сайта форсирует процесс очистки кэша

source: ServerInformationDescription
ru: перейти к просмотру информации о сервере (версия операционной системы, системные переменны и т.д.).

# ServerInformationPageTite
source: Server Information
ru: Информация о сервере

source: Show message
ru: Показать сообщение

source: System
ru: Система

source: SystemInformationDescription
ru: перейти к просмотру системной информации веб-приложения (сведения о базе данных, системных директориях и т.д.).

# SystemInformationPageTite
source: System Information
ru: Системная информация

source: SystemLogDescription
ru: перейти к просмотру системных логов.

# SystemWorkInDebugMode
source: System work in <b>Debug</b> mode.
ru: Система работает в <strong>Debug</strong>-режиме. Свяжитесь со службой поддержки.

source: Upload file
ru: Загрузить файл

source: Version
ru: Версия

source: Warning!
ru: Внимание!

source: Webapplication address
ru: Адрес вб-приложения

# WebApplicationLink
source: Go to webapplication
ru: Главная страница сайта

# WebsiteStorageConnectionString
source: Webapplication storage connection string
ru: Строка подключения к хранилищу веб-приложения

# WelcomeMessage
source: Welcome to Data Management System
ru: Добро пожаловать в систему упраления данными

source: You login as
ru: Вы вошли как

source: You work with project
ru: Вы работаете с проeктом

# LoginButtonText
source: Login
ru: Войти

source: Update
ru: Обновить

# ViewChildRecords
source: Child records
ru: Просмотреть записи

source: Status
ru: Статус

# CustomLinks
source: Plugins
ru: Плагины

# SystemLinks
source: System commands
ru: Системные команды

# TableLinks
source: Entities
ru: Данные

# LoginError
source: Incorrect login or password
ru: В доступе отказано
